# Brewfile of August Guidry
# brew tap
tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/dev-tools'
tap 'homebrew/services'

# brew install
brew 'asdf'
brew 'bash'
brew 'calc'
brew 'cmus'
brew 'composer'
brew 'davmail'
brew 'direnv'
brew 'docker'
brew 'docker-compose'
brew 'emacs'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fisher'
brew 'font-monaspace'
brew 'fzf'
brew 'git'
brew 'gpg'
brew 'htop'
brew 'hugo'
brew 'ispell'
brew 'lighttpd'
brew 'marked'
brew 'mas'
brew 'neofetch'
brew 'neomutt'
brew 'neovim'
brew 'newsboat'
brew 'node'
brew 'notmuch'
brew 'pass'
brew 'pass-otp'
brew 'peco'
brew 'proselint'
brew 'remind'
brew 'ripgrep'
brew 'shellcheck'
brew 'speedread'
brew 'speedtest-cli'
brew 'sqlite'
brew 'syncthing'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tpm'
brew 'tree'
brew 'urlview'
brew 'vim'
brew 'w3m'
brew 'webp'
brew 'webpack'
brew 'wget'
brew 'whalebrew'
brew 'xdg-ninja'
brew 'yt-dlp'
brew 'z'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'

# brew install --cask
cask 'amethyst'
cask 'anki'
cask 'appcleaner'
cask 'blender'
cask 'calibre'
cask 'darktable'
cask 'discord'
cask 'electrum'
cask 'font-hack-nerd-font'
cask 'gemini'
cask 'github'
cask 'godot'
cask 'gpg-suite'
cask 'iterm2'
cask 'keyclu'
cask 'libreoffice'
cask 'microsoft-excel'
cask 'microsoft-outlook'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'minecraft'
cask 'monero-wallet'
cask 'mpv'
cask 'musicbrainz-picard'
cask 'obs'
cask 'obsidian'
cask 'onedrive'
cask 'onyx'
cask 'openaudible'
cask 'pixelorama'
cask 'porting-kit'
cask 'soulseek'
cask 'steam'
cask 'tor-browser'
cask 'transmission'
cask 'wacom-tablet'

# mas install
mas '1Blocker', id: 1365531024
mas 'Dark Reader for Safari', id:1438243180
mas 'Developer', id: 640199958
mas 'FastVPN', id: 1419729466
mas 'Final Cut Pro', id: 424389933
mas 'GarageBand', id: 682658836
mas 'Keynote', id: 409183694
mas 'Logic Pro', id: 634148309
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Save to Pocket', id: 1477385213
mas 'Tampermonkey', id: 1482490089
mas 'Userscripts-Mac-App', id: 1463298887
mas 'Vimari', id: 1480933944
mas 'Xcode', id: 1419729466
mas 'iA Writer', id: 775737590
mas 'iMovie', id: 408981434

# whalebrew install
# example: whalebrew 'whalebrew/wget'

# vscode --install-extension
# example: vscode "GitHub.codespaces"
