# Brewfile of August Guidry
# 'brew tap'
# tap 'homebrew/cask'
# tap 'homebrew/cask-drivers'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
# tap 'homebrew/core'
# tap 'homebrew/boneyard'
# tap 'homebrew/dev-tools'
# tap 'homebrew/bundle'
# tap 'homebrew/services'

# 'brew install'
brew 'bash'
brew 'chruby'
brew 'cmus'
brew 'composer'
brew 'davmail'
brew 'direnv'
brew 'docker'
brew 'docker-compose'
brew 'dotnet'
brew 'emacs'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fisher'
brew 'fzf'
brew 'git'
brew 'gpg'
brew 'htop'
brew 'hugo'
brew 'ispell'
brew 'lighttpd'
brew 'marked'
brew 'mas'
brew 'mpv'
brew 'neofetch'
brew 'neomutt'
brew 'neovim'
brew 'newsboat'
brew 'node'
brew 'notmuch'
brew 'nvm'
brew 'pass'
brew 'peco'
brew 'powerline-go'
brew 'python'
brew 'ripgrep'
brew 'ruby'
brew 'shellcheck'
brew 'speedtest-cli'
brew 'sqlite'
brew 'syncthing'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'urlview'
brew 'vim'
brew 'w3m'
brew 'webp'
brew 'wget'
brew 'whalebrew'
brew 'xdg-ninja'
brew 'yt-dlp'
brew 'z'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'

# Brew cask applications
# 'brew install --cask'
cask 'adobe-creative-cloud'
cask 'anki'
cask 'appcleaner'
cask 'blender'
cask 'calibre'
cask 'emacs'
cask 'gemini'
cask 'github'
cask 'godot'
cask 'iina'
cask 'iterm2'
cask 'jellyfin'
cask 'keyclu'
cask 'libreoffice'
cask 'logitech-options'
cask 'microsoft-excel'
cask 'microsoft-office'
cask 'microsoft-onenote'
cask 'microsoft-outlook'
cask 'microsoft-powerpoint'
cask 'microsoft-teams'
cask 'microsoft-word'
cask 'minecraft'
cask 'monero-wallet'
cask 'musicbrainz-picard'
cask 'obs'
cask 'obsidian'
cask 'onedrive'
cask 'onyx'
cask 'pixelorama'
cask 'quickbooks'
cask 'soulseek'
cask 'steam'
cask 'thunderbird'
cask 'tor-browser'
cask 'transmission'
cask 'visual-studio-code'
cask 'wacom-tablet'
cask 'wasabi-wallet'

# 'mas install'
mas '1Blocker', id: 1365531024
mas 'Developer', id: 640199958
mas 'FastVPN', id: 1419729466
mas 'GarageBand', id: 682658836
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Xcode', id: 1419729466
mas 'iA Writer', id: 775737590
mas 'iMovie', id: 408981434

# 'whalebrew install'
whalebrew 'whalebrew/wget'

# 'vscode --install-extension'
vscode "GitHub.codespaces"
